# NumMembers Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RadialArray..::..NumMembers Property
RadialArray Class See Also
---
Retrieves or changes the number of the arrayed members.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override int NumMembers { get; set; }
```

Visual Basic
---
```text
Public Overrides Property NumMembers As Integer
	Get
	Set
```

Visual C++
---
```text
public:
virtual property int NumMembers {
	int get () override;
	void set (int value) override;
}
```

# See Also
RadialArray Class
Autodesk.Revit.DB Namespace